
#เขียนรับค่าinputที่เป็นstring
a = str(input("Enter string :"))
#สร้างตัวแปรไว้เปรียบเทียบกับค่าตัวเลข
number = '0123456789'
#สร้างตัวแปรที่ไว้เก็บค่าคำตอบที่เป็นตัวเลขเพื่อให้ตัวแปรเริ่มต้นมีค่าว่าง
answer = ''
#เก็บค่าจำนวนstringที่inputเข้ามาเพื่อใช้ในการเปรียบเทียบ
x = range(len(a))

#สร้างfor loop โดยให้ค่า n มีค่า เริ่มตั้งแต่ 0 และวนซ้ำเพิ่มขึ้นเรื่อยๆทีละ 1 จนมีค่าเท่ากับตัวแปร x
for n in x :
    i = 0
    #สร้างwhile loopขึ้นมาให้ทำงานจนกว่าค่า i จะไม่มีค่าน้อยกว่า 10
    while i < 10 :
        """เปรียบเทียบค่า string ที่ input เข้ามาโดยเริ่มทีละตัวตั้งแต่ค่าสตริงที่ตำแหน่ง a[0]
        (ต่อ) นำมาเปรียบเทียบกับค่า string ในตัวแปรnumberทีละตำแหน่งซึ่งจะเรียงจากหมายเลข 0-9 ซึ่งเป็นค่าตัวเลขที่ครบถ้วน
        (ต่อ) โดยหากค่า string ที่ตำแหน่ง a[n] มีค่าเหมือนกันกับตำแหน่ง number[i] ก็จะให้ทำการเพิ่ม string ตัวนั้นไปยังตัวแปร answer"""
        if a[n] == number[i] :
            answer += a[n]
        #ให้ i เพิ่มขึ้น 1 ทุกครั้งที่ทำงานเสร็จเพื่อให้วนซ้ำได้ครบทุกตัวเลข และเพื่อให้ออกจาก while loop จะได้ให้ loop for ทำงานเพื่อนำตัวต่อไปมาเปรียบเทียบ
        i += 1
        
#ต้องการทำให้ตัวแปร answer เป็นค่า interger จึงสร้างตัวแปร answerInt ขึ้นมาและกำหนดให้มีค่าเท่ากับ nt(answer)
answerInt = int(answer)
#ทำการ print เพื่อตรวจสอบประเภทของตัวแปรที่เป็นคำตอบ
print(type(answerInt))
#print คำตอบ
print(answerInt)

        
        
